Autodesk.Revit.DB.Structure.LoadBase.RemoveHostConstraint
Removes constraint from host for this load.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This LoadBase is not a constraint load.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
Thrown when the load is an AreaLoad and the host is an Analytical Panel with curved profile.
Since:
2024

Autodesk.Revit.DB.Structure.LoadBase.IsConstrainedOnHost
The load is constrained to host or not.
Since:
2024